# -*- coding = utf-8 -*-
# @Time : 2021/6/2 14:00
# Author : ZYK
# @File : config.py
# @Software: PyCharm
# 用于存储整个项目所需要用到的数据

"""卡池内容"""
up = '可莉'
st5 = [up, '刻晴', '莫娜', '七七', '迪卢克', '琴']
cha_4 = ['安柏', '丽莎', '凯亚', '芭芭拉', '雷泽', '菲谢尔', '班尼特', '诺艾尔', '菲谢尔', '砂糖',
         '迪奥娜', '北斗', '凝光', '香菱', '行秋', '重云', '辛焱']
weapon_4 = ['弓藏', '祭礼弓', '绝弦', '西风猎弓', '昭心', '祭礼残章', '流浪乐章', '西风秘典', '西风长枪',
            '雨裁', '匣里灭辰', '祭礼大剑', '钟剑', '西风大剑', '匣里龙吟', '祭礼剑', '笛剑', '西风剑']
weapon_3 = ['旅行剑', '冷刃', '黎明神剑', '飞天御剑', '吃鱼虎刀', '白铁大剑', '沐浴龙血的剑', '以理服人', '飞天大御剑',
            '铁影阔剑', '甲级宝钰', '魔导绪论', '异世界行记', '翡玉法球', '讨龙英杰谭', '白缨枪', '铖矛', '黑缨枪', '信使',
            '鸦羽弓', '反曲弓', '神射手之誓', '弹弓']
this_time5 = 0  # 用于记录是否歪了
this_time4 = 0  # 记录四星是否保底了
times = 0
get = []  # 这是每次抽奖后存储抽出内容的列表
have = []  # 这是存储总抽出内容的列表
have4 = []  # 用于记录抽到的四星
have5 = []  # 用于记录抽到的五星
stone = 160000  # 原石
debt = 10000  # RMB
page = 0  # 用于实现翻页,其中page为业面顶部第一条记录的物理位置
number = 0  # 算命结果, 对抽卡概率会产生影响，取值为 0.5 或者 1.5
